import {Post} from '../model/Post';

// тестовые данные в виде массивов (заменяют таблицы БД)
export class TestData {

    static posts: Post[] = [
        {id: 1, title: 'Работа', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 2, title: 'Семья', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 3, title: 'Учеба', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 4, title: 'Отдых', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 5, title: 'Спорт', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 6, title: 'Еда', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 7, title: 'Финансы', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 8, title: 'Гаджеты', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 9, title: 'Здоровье', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 10, title: 'Автомобиль', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
        {id: 11, title: 'Ремонт', text: ' Товарищи! консультация с широким активом играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. '},
    ];



}
